cask_args appdir: "/Applications", require_sha: true

# =============================================================================
# CORE BREWFILE - Essential development tools and daily apps
# =============================================================================
# Optional packages are in Brewfile.work and Brewfile.optional
# Install with: brew bundle --file=Brewfile.work
# =============================================================================

# -----------------------------------------------------------------------------
# CLI: Development
# -----------------------------------------------------------------------------
brew "neovim"
brew "python@3.11"
brew "python-tk"
brew "pnpm"

# -----------------------------------------------------------------------------
# CLI: Language version managers
# -----------------------------------------------------------------------------
brew "rustup"

# -----------------------------------------------------------------------------
# CLI: Database
# -----------------------------------------------------------------------------
brew "pgcli"

# -----------------------------------------------------------------------------
# CLI: Utilities
# -----------------------------------------------------------------------------
brew "ripgrep"
brew "tree"
brew "fzf"
brew "chafa"
brew "gh"

# -----------------------------------------------------------------------------
# CLI: Terminal multiplexer
# -----------------------------------------------------------------------------
brew "tmux"

# -----------------------------------------------------------------------------
# CLI: Formatters & linters
# -----------------------------------------------------------------------------
brew "stylua"

# -----------------------------------------------------------------------------
# GUI: Terminals
# -----------------------------------------------------------------------------
cask "iterm2"

# -----------------------------------------------------------------------------
# GUI: Productivity
# -----------------------------------------------------------------------------
cask "claude"
cask "claude-code"

# -----------------------------------------------------------------------------
# GUI: System utilities
# -----------------------------------------------------------------------------
cask "karabiner-elements"
cask "font-jetbrains-mono-nerd-font"

# -----------------------------------------------------------------------------
# App Store: Productivity
# -----------------------------------------------------------------------------
mas "magnet", id: 441258766
mas "dropover", id: 1355679052
