cask_args appdir: "/Applications", require_sha: true

# =============================================================================
# CORE BREWFILE - Essential development tools and daily apps
# =============================================================================
# Optional packages are in Brewfile.work and Brewfile.optional
# Install with: brew bundle --file=Brewfile.work
# =============================================================================

# Taps
tap "1password/tap"

# -----------------------------------------------------------------------------
# CLI: Development
# -----------------------------------------------------------------------------
brew "neovim"
brew "python@3.11"
brew "python-tk"
brew "deno"
brew "pnpm"

# -----------------------------------------------------------------------------
# CLI: Language version managers
# -----------------------------------------------------------------------------
brew "rustup"
brew "goenv"

# -----------------------------------------------------------------------------
# CLI: Database
# -----------------------------------------------------------------------------
brew "pgcli"

# -----------------------------------------------------------------------------
# CLI: Utilities
# -----------------------------------------------------------------------------
brew "ripgrep"
brew "tree"
brew "fzf"
brew "chafa"
brew "gh"

# -----------------------------------------------------------------------------
# CLI: Terminal multiplexer
# -----------------------------------------------------------------------------
brew "tmux"
brew "tpm"

# -----------------------------------------------------------------------------
# CLI: Formatters & linters
# -----------------------------------------------------------------------------
brew "stylua"

# -----------------------------------------------------------------------------
# GUI: Terminals
# -----------------------------------------------------------------------------
cask "iterm2"
cask "alacritty"

# -----------------------------------------------------------------------------
# GUI: Browsers
# -----------------------------------------------------------------------------
cask "firefox"
cask "zen"

# -----------------------------------------------------------------------------
# GUI: Productivity
# -----------------------------------------------------------------------------
cask "alfred"
cask "obsidian"
cask "claude"
cask "claude-code"

# -----------------------------------------------------------------------------
# GUI: Security & privacy
# -----------------------------------------------------------------------------
cask "1password-cli"
cask "1password"

# -----------------------------------------------------------------------------
# GUI: System utilities
# -----------------------------------------------------------------------------
cask "karabiner-elements"
cask "font-jetbrains-mono-nerd-font"
cask "hiddenbar"
cask "stats"

# -----------------------------------------------------------------------------
# App Store: Productivity
# -----------------------------------------------------------------------------
mas "magnet", id: 441258766
mas "dropover", id: 1355679052

# -----------------------------------------------------------------------------
# App Store: Safari extensions
# -----------------------------------------------------------------------------
mas "1password for safari", id: 1569813296
mas "keys for safari", id: 1494642810
mas "refined github", id: 1519867270
mas "wappalyzer", id: 1520333300
